[{"title":"Penelitian ","content":"Berdasarkan gambar di atas, dapat dilihat bahwa roadmap jurusan Teknologi Kesehatan Gigi dibagi menjadi 3 periode utama, yaitu: \n 1. Periode I (2016 &ndash; 2021) berfokus pada peningkatan kuantitas dan minat menulis dan mempublikasikan riset- riset dasar bidang Teknologi Kesehatan Gigi \n 2. Periode II (2022 &ndash; 2026) berfokus pada pengembangan riset-riset dasar bidang ilmu Teknologi Kesehatan Gigimenuju riset-riset terapan Teknologi Kesehatan Gigi \n 3. Periode III (2027 &ndash; 2031) berfokus pada riset-riset kolaboratif ilmu dasar dan terapan bidang Teknologi Kesehatan Gigi berbasis teknologi digital","slug":"penelitian"},{"title":"Profil","content":"Profil Program Studi D-IV Teknologi Kesehatan Gigi  \n \n Program Pendidikan Sarjana Terapan Teknologi Kesehatan Gigi Fakultas Vokasi Universitas Airlangga saat ini merupakan satu-satunya pendidikan tinggi dengan strata sarjana terapan dibidang keteknisian gigi yang berada di Indonesia. Program Studi Sarjana Terapan Teknologi Kesehatan Gigi adalah prodi di bidang keteknisian gigi yang mandiri dan inovatif yang mengedepankan estetik dan berbasis IPTEK mutakhir. Lulusan prodi merupakan mitra kerja dokter gigi dan dokter gigi spesialis dalam upaya meningkatkan kesehatan masyarakat khususnya dibidang Kesehatan gigi yang paripurna. Kompetensi lulusan dirancang untuk dapat mengakomodasi kompetensi Dokter Gigi umum dan Spesialis, serta perkembangan teknologi dibidang keteknisian gigi yang sangat pesat terutama dibidang digital dentistry. Penyelenggaraan Program Pendidikan Sarjana Terapan Teknologi Kesehatan Gigi menggunakan Kurikulum vokasional yang mengacu pada Handbook Certified Dental Technision (CDT) yang diakui oleh National Association of Dental Laboratories (NADL), American Dental Association (ADA) dan American College of Prosthodontists (ACP) dan Standar Profesi Teknisi Gigi (Keputusan Menteri Kesehatan RI Nomor: HK.01.07\/Menkes\/460\/2020). \n  \n  \n \n  Keunggulan Program Studi D-IV Teknologi Kesehatan Gigi  \n \n Keunggulan prodi yaitu mengedepankan estetik pada semua produk perangkat gigi yang dihasilkan diimplementasikan pada CPL aspek pengetahuan serta ketrampilan khusus dan diturunkan pada MK pelilinan fungsional baik kuliah maupun praktikum serta hampir semua MK kompetensi prodi. Implementasi soft skill dilaksanakan melalui kegiatan mahasiswa intra dan ekstra kurikuler agar menghasilkan tenaga kerja terdidik yang kompeten, dan mampu bekerja sama dalam tim, memiliki kemampuan memecahkan masalah secara efektif, mampu memproses dan memanfaatkan informasi, serta mampu memanfaatkan teknologi secara efektif dalam pasar global untuk meningkatkan produktivitas kerja.","slug":"jguyygi"},{"title":"Visi Misi","content":"Visi  \n \n Visi Program Studi Terapan Teknologi Kesehatan Gigi adalah menjadi prodi terkemuka di bidang gigi yang mandiri dan inovatif yang mengedepankan estetik berbasis IPTEK mutkahir di tingkat Nasioanal dan Internasional berdasarkan moral agama.&nbsp; \n  \n \n  Misi  \n \n Misi Program Studi Terapan Teknologi Kesehatan Gigi adalah: \n \n Meyelenggarakan pendidikan vokasional di bidang teknologi kesehatan gigi yang mengedepankan estetik berbasis IPTEK mutakhir yang mampu bersaing di tingkat Nasioanal dan Internasional; \n menyelenggarakan penelitian terapan yang inovatif di bidang teknologi kesehatan gigi yang&nbsp; mengedepankan estetik berbasis IPTEK mutakhir berlandaskan nilai kebangsaan dan moral agama untuk menunjang pengembangan pendidikan Teknologi Kesehatan Gigi dan Pengabdian kepada masyarakat di bidang laboratorium keteknisian gigi; \n Mendharmabaktikan keahlian vokasional di bidang Teknologi Kesehatan Gigi yang mengedepankan estetika kepada masyarakat dalam lingkup nasional dan internasional; \n menjalin kerjasama dengan segenap stakeholders dalam berbagai kegiatan pendidikan,penelitan,dan pengabdian kepada masyarakat.&nbsp;&nbsp;","slug":"visi-misi"},{"title":"Sejarah","content":"Program Studi Sarjana Terapan Teknologi Kesehatan Gigi merupakan hasil pengembangan dari Program Studi D-III Teknik Gigi. Diketahui bersama bahwa D-III Teknik Gigi merupakan pendidikan Ahli Madya Kesehatan yang lahir dari Fakultas Non Gelar Kesehatan. Fakultas non gelar kesehatan tersebut kemudian dilebur dalam Fakultas Kedokteran Gigi Universitas Airlangga. \n  \n Secara historis, Program D3 Teknik Gigi didirikan sejak tahun 1984 berdasarkan SK Dirjen Dikti Depdikbud RI No. 117\/DIKTI\/Kop\/1984 di bawah naungan Fakultas Non Gelar Kesehatan Universitas Airlangga. Peringkat akreditasi terakhir adalah pada tahun 2020. Prodi Teknologi Kesehatan Gigi yang awalnya berada di bawah Fakultas Kedokteran Gigi dialihkan ke Fakultas Vokasi sejak berdirinya Fakultas Vokasi yang menjadi fakultas ke-14 di Universitas Airlangga pada tahun 2014 berdasarkan Statuta Universitas Airlangga yang ditetapkan melalui Peraturan Pemerintah Nomor 30 Tahun 2014 pada tanggal 14 Mei 2014. Hal tersebut dikuatkan dengan Keputusan Rektor Universitas Airlangga Nomor 1539\/UN3\/2014. \n  \n Pendirian Prodi Sarjana Terapan Teknologi Kesehatan Gigi dituangkan dalam SK Rektor Universitas Airlangga No. 522\/UN3\/2023 tertanggal 7 Juni 2023, merupakan jawaban atas tuntutan stake holder akan kebutuhan tenaga teknisi gigi yang mampu mengimbangi perkembangan teknologi khususnya di bidang keteknisian gigi. Oleh karena itu, kurikulum Prodi Teknologi Kesehatan Gigi dirancang untuk menghasilkan lulusan Teknologi Kesehatan Gigi yang kompeten dan sanggup mengakomodir kebutuhan dokter gigi spesialis.","slug":"create-your-own-content"},{"title":"Staff Pengajar ","content":"","slug":"set-up-your-new-site"},{"title":"Kurikulum","content":"Kurikulum D-IV Teknologi Kesehatan Gigi  \n \n Kurikulum merujuk pada serangkaian rencana dan pengaturan yang melibatkan tujuan, materi pelajaran, dan metode yang berfungsi sebagai panduan dalam menyelenggarakan kegiatan pembelajaran untuk mencapai target pendidikan tinggi. \n Kurikulum yang berlaku perlu mencakup pencapaian pembelajaran yang mengacu pada pedoman Standar Nasional Pendidikan Tinggi (SN-Dikti), seperti yang telah diatur dalam Permendikbud No. 3 Tahun 2020 dan Standar Profesi Teknisi Gigi (Keputusan Menteri Kesehatan RI Nomor: HK.o1.07\/Menkes\/460\/2020). \n Penyelenggaraan Program Pendidikan Sarjana Terapan Teknologi Kesehatan Gigi menggunakan kurikulum vokasional.&nbsp; Kurikulum tersebut mengacu pada Handbook Certified Dental Technision (CDT) yang diakui oleh National Association of Dental Laboratories (NADL); American Dental Association (ADA); dan American College of Prosthodontists (ACP). \n  \n  \n \n  Proses Penyusunan Kurikulum  \n \n Kurikulum Program Pendidikan Sarjana Terapan Teknologi Kesehatan Gigi disusun melalui kerja sama melalui FGD dengan Industri dan Dunia Kerja (IDUKA), pendididkan dokter spesialis khususnya prostodontik, asosiasi pendidikan sejenis prodi D-III Teknik gigi, serta ikatan profesi. \n  \n  \n \n  Struktur Kurikulum  \n \n Mata Kuliah Teori: 65 sks (36,1%) \n Mata Kuliah Praktik: 84 sks (63.9%) \n Jumlah sks: 149 \n Lama studi: 8 semester \n  \n  \n \n  Kegiatan MBKM  \n \n Praktik \n PKL \n KKN \n Skripsi \n Magang \n &nbsp; \n  \n \n  Metode Pembelajaran  \n \n Case Study \n Small Group Discussion (SGD) \n Self-Directed Learning (SDL) \n Cooperative Learning (CL) \n Contextual Instruction (CI) \n Problem-Based Learning (PBL) \n Project-Based Learning (PjBL) \n &nbsp; \n \n  Rumusan Perubahan Diploma Menjadi Sarjana  \n \n Kurikulum yang dikembangkan prodi memenuhi standar kompetensi (competency-based curriculum) dan berbasis OBE (outcome-based education) dengan pengembangan kecerdasan intelektual, akhlak mulia, dan keterampilan sehingga mampu menjadi tenaga yang handal dibidangnya; \n Berdasarkan need assessment, selain ketrampilan, sesuai dengan kebutuhan jaman, juga diperlukan kemampuan komunikasi, kolaborasi, berpikir kritis, berpikir kreatif, logika komputasi dan kepedulian; \n Berdasar hasil evaluasi kurikulum dirumuskan profil lulusan beserta deskripsinya yang menjadi tujuan penyelenggaraan program studi. Penetapan Profil lulusan akan menjadi menjadi arah dalam perumusan CPL (Capaian Pembelajaran Lulusan atau Learning Outcome\/Student Outcome (LO\/SO)), karena sikap, pengetahuan, dan keterampilan yang dirumuskan membangun pengetahuan dan keahlian yang diperlukan; \n Pelaksanaan kegiatan pembelajaran ketepatan pemilihan","slug":"follow-bludit"}]